plan from CI

```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.inventory.aws_iam_instance_profile.inventory will be created
  + resource "aws_iam_instance_profile" "inventory" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "inventory_profile-sandbox"
      + path        = "/"
      + role        = "inventory-sandbox-s3-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.inventory.aws_iam_role.inventory will be created
  + resource "aws_iam_role" "inventory" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "InventoryS3AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "inventory-sandbox-s3-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.inventory.aws_iam_role_policy.inventory will be created
  + resource "aws_iam_role_policy" "inventory" {
      + id     = (known after apply)
      + name   = "inventory_s3_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::datagov-appdata-inventory-sandbox",
                          + "arn:aws:s3:::datagov-appdata-inventory-sandbox/*",
                        ]
                    },
                  + {
                      + Action   = "S3:ListAllMyBuckets"
                      + Resource = "arn:aws:s3:::*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.inventory.aws_security_group.inventory will be created
  + resource "aws_security_group" "inventory" {
      + arn                    = (known after apply)
      + description            = "Security group for inventory web instance in sandbox"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "inventory-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory_2_8.aws_iam_role_policy.inventory will be created
  + resource "aws_iam_role_policy" "inventory" {
      + id     = (known after apply)
      + name   = "inventory_s3_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::datagov-appdata-inventory-2-8-sandbox",
                          + "arn:aws:s3:::datagov-appdata-inventory-2-8-sandbox/*",
                        ]
                    },
                  + {
                      + Action   = "S3:ListAllMyBuckets"
                      + Resource = "arn:aws:s3:::*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "inventory-2-8-sandbox-s3-role"
    }

  # module.catalog_next.module.redis.aws_elasticache_cluster.redis will be created
  + resource "aws_elasticache_cluster" "redis" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "catalog-next-sandbox"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.6"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t3.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = "default.redis5.0"
      + port                   = 6379
      + replication_group_id   = (known after apply)
      + security_group_ids     = (known after apply)
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = "catalog-next-sandbox"
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "catalog-next"
        }
    }

  # module.catalog_next.module.redis.aws_security_group.redis will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b12b4fe2af2af50d",
                  + "sg-0ffc56bc3aad6cdcc",
                ]
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "catalog-next-redis-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "catalog-next"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory.module.redis.aws_elasticache_cluster.redis will be created
  + resource "aws_elasticache_cluster" "redis" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "inventory-sandbox"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.6"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t3.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = "default.redis5.0"
      + port                   = 6379
      + replication_group_id   = (known after apply)
      + security_group_ids     = (known after apply)
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = "inventory-sandbox"
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory"
        }
    }

  # module.inventory.module.redis.aws_elasticache_subnet_group.redis will be created
  + resource "aws_elasticache_subnet_group" "redis" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "inventory-sandbox"
      + subnet_ids  = [
          + "subnet-0bbe8705ad1ce9a08",
          + "subnet-0f531007fa515a1fb",
        ]
    }

  # module.inventory.module.redis.aws_security_group.redis will be created
  + resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "inventory-redis-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env"  = "sandbox"
          + "name" = "inventory"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }

  # module.inventory.module.s3.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "datagov-appdata-inventory-sandbox"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.inventory_2_8.module.s3.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "datagov-appdata-inventory-2-8-sandbox"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.inventory.module.db.module.database.aws_db_instance.default will be updated in-place
  ~ resource "aws_db_instance" "default" {
        address                               = "terraform-20200416212509303000000001.clsowbdquocd.us-east-1.rds.amazonaws.com"
      ~ allocated_storage                     = 10 -> 20
        arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200416212509303000000001"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1b"
        backup_retention_period               = 0
        backup_window                         = "05:27-05:57"
        ca_cert_identifier                    = "rds-ca-2019"
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
        deletion_protection                   = false
        enabled_cloudwatch_logs_exports       = []
        endpoint                              = "terraform-20200416212509303000000001.clsowbdquocd.us-east-1.rds.amazonaws.com:5432"
        engine                                = "postgres"
        engine_version                        = "9.6.11"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "terraform-20200416212509303000000001"
        identifier                            = "terraform-20200416212509303000000001"
        instance_class                        = "db.t2.micro"
        iops                                  = 0
        license_model                         = "postgresql-license"
        maintenance_window                    = "mon:04:20-mon:04:50"
        max_allocated_storage                 = 0
        monitoring_interval                   = 0
        multi_az                              = false
        name                                  = "inventory_db"
        option_group_name                     = "default:postgres-9-6"
        parameter_group_name                  = "default.postgres9.6"
        password                              = (sensitive value)
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 5432
        publicly_accessible                   = false
        replicas                              = []
        resource_id                           = "db-VI62EBRKYYQYVL2EOGMMUNYQFA"
        security_group_names                  = []
        skip_final_snapshot                   = true
        status                                = "available"
        storage_encrypted                     = false
        storage_type                          = "gp2"
        tags                                  = {}
        username                              = "inventory_master"
        vpc_security_group_ids                = [
            "sg-089c7718ede99bc15",
        ]
    }

Plan: 12 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------
```